furniturewishlister-backend/app/controllers/furniturewishlists_controller.rb

    def index
        all = Furniturewishlist.all
---
SELECT "furniturewishlists".* FROM "furniturewishlists"