furniturewishlister-backend/app/controllers/furnitures_controller.rb

SELECT "furnitures".* FROM "furnitures"
---
    def index
        furnitures = Furniture.all

INSERT INTO "furnitures" ("name", "brand", "category", "color", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "cute"], ["brand", "soho"], ["category", "minimalist"], ["color", "brown"], ["image", ""], ["created_at", "2021-03-09 15:53:56.075050"], ["updated_at", "2021-03-09 15:53:56.075050"]]
---
    def create
        new_item = Furniture.create(furniture_params)

SELECT "furnitures".* FROM "furnitures" WHERE "furnitures"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "furnitures" SET "name" = ?, "brand" = ?, "updated_at" = ? WHERE "furnitures"."id" = ?  [["name", "qweqe"], ["brand", "qwewqe"], ["updated_at", "2021-03-09 17:50:40.556750"], ["id", 21]]
---
    def update
        item = Furniture.find(params[:id])
        item.update(furniture_params)

SELECT "furnitures".* FROM "furnitures" WHERE "furnitures"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "furnitures" WHERE "furnitures"."id" = ?  [["id", 15]]
---
    def delete
        item = Furniture.find_by(id: params[:id])
        item.destroy