furniturewishlister-backend/app/controllers/users_controller.rb

    def show
        current_user = User.find_or_create_by(username: params[:username])
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "brianr4548"], ["created_at", "2021-03-09 21:15:19.459332"], ["updated_at", "2021-03-09 21:15:19.459332"]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "brianr4548"], ["LIMIT", 1]]