furniturewishlister-backend/app/controllers/wishlists_controller.rb

SELECT "wishlists".* FROM "wishlists"
---
    def index
        wishlists = Wishlist.all

INSERT INTO "wishlists" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "my living room "], ["user_id", 10], ["created_at", "2021-03-09 15:49:10.508040"], ["updated_at", "2021-03-09 15:49:10.508040"]]
---
    def create
        new_item = Wishlist.create(wishlist_params)

SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "wishlists" WHERE "wishlists"."id" = ?  [["id", 2]]
---
    def delete
        wishlist = Wishlist.find_by(id: params[:id])
        wishlist.destroy