furniturewishlister-backend/app/controllers/wishlist_furnitures_controller.rb

INSERT INTO "wishlist_furnitures" ("furniture_id", "wishlist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["furniture_id", 1], ["wishlist_id", 1], ["created_at", "2021-03-09 21:32:10.687688"], ["updated_at", "2021-03-09 21:32:10.687688"]]
---
    def create
        wishlist_furniture = WishlistFurniture.create(wishlist_furniture_params)

SELECT "furnitures".* FROM "furnitures" WHERE "furnitures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def delete
        joiner = WishlistFurniture.find_by(id: params[:id])